[{"Summary": "Sources: State and local health agencies (cases, deaths); U.S. Department of Health and Human Services (test positivity, hospitalizations, I.C.U.\nviral test specimens tested by laboratories and state health departments and reported to the federal government by the 50 states, Washington D.C. and Puerto Rico.\nCase and death seven-day averages are adjusted to reduce the impact of anomalous reporting.\nFor the U.S. national case and death count averages, the average is the sum of the average number of cases and deaths in all states and territories each day.\nThis average may not match the average when calculated from the U.S. case and death total in order to account for irregularly timed case and death reports at the state level."}, {"Summary": "Oral ritonavir-boosted nirmatrelvir (Paxlovid)In a clinical trial, ritonavir-boosted nirmatrelvir reduced the risk of hospitalization and death by 86% in unvaccinated outpatients with COVID-19 at higher risk of severe disease.\n(4) Similar results were observed in patients with prior immunity to the virus that causes COVID-19.\nClinicians may recommend longer or additional courses of ritonavir-boosted nirmatrelvir for immunocompromised patients who continue experiencing COVID-19 symptoms after receiving antiviral treatment.\nClinicians should be aware of the eligibility criteria and the potential for drug interactions with the use of ritonavir-boosted nirmatrelvir that may preclude ritonavir-boosted nirmatrelvir use or may require temporary discontinuation of other medications.\nFor more information about viral rebound and the recurrence of COVID-19 symptoms, refer to the NIH COVID-19 Treatment Guidelines: Ritonavir-Boosted Nirmatrelvir (Paxlovid)."}, {"Summary": "U.S. Offers Another Round of Free Covid Tests Through the MailHouseholds may now order another four at-home tests, or eight if they have not placed an order since the program was revived in September."}, {"Summary": "In the first year of the COVID-19 pandemic, global prevalence of anxiety and depression increased by a massive 25%, according to a scientific brief released by the World Health Organization (WHO) today.\nGaps in careThis increase in the prevalence of mental health problems has coincided with severe disruptions to mental health services, leaving huge gaps in care for those who need it most.\nThey adopted the updated Comprehensive Mental Health Action Plan 2013-2030, which includes an indicator on preparedness for mental health and psychosocial support in public health emergencies.\nWHO’s most recent Mental Health Atlas showed that in 2020, governments worldwide spent on average just over 2% of their health budgets on mental health and many low-income countries reported having fewer than 1 mental health worker per 100 000 people.\nDévora Kestel, Director of the Department of Mental Health and Substance Use at WHO, sums up the situation: ”While the pandemic has generated interest in and concern for mental health, it has also revealed historical under-investment in mental health services."}, {"Summary": "OverviewThe COVID-19 pandemic has had a severe impact on the mental health and wellbeing of people around the world while also raising concerns of increased suicidal behaviour.\nIn addition access to mental health services has been severely impeded.\nHowever, no comprehensive summary of the current data on these impacts has until now been made widely available.\nThis scientific brief is based on evidence from research commissioned by WHO, including an umbrella review of systematic reviews and meta-analyses and an update to a living systematic review.\nInformed by these reviews, the scientific brief provides a comprehensive overview of current evidence about:"}, {"Summary": "Georgia residents who are currently sick, shut-in or homebound due to an ongoing physical or mental disability and are unable to travel to a COVID-19 vaccination site can request to receive vaccination at their home.\nPlease email [email protected] or call (888) 572-0112 with the following information for the person who requires at-home vaccination:"}, {"Summary": "Not only do we have the lowest COVID positivity rate in the United States of America, we have hit 70 percent vaccination ahead of schedule.\nWe successfully deployed the weapon that will win the war, and New York led the nation,\" Governor Cuomo said.\n\"We led with nurse Sandra Lindsay, who was the first at Northwell to take that vaccine and to assure people it was safe.\nWe've gone on to do more than 20 million vaccines, more per capita than any big state in the United States of America.\nThe state mandates that have proven right and brought us through this pandemic are relaxed as of today, effective immediately.\""}, {"Summary": ""}, {"Summary": "To date, 75% of the state's ~450,000 hospital workers, 74% of the state's ~30,000 adult care facility workers, and 68% of the state's ~145,500 nursing home workers have completed their vaccine series.\n\"When COVID ambushed New York last year, New Yorkers acted, while the Federal Government denied the problem,\" Governor Cuomo said.\nNew York State Health Commissioner Dr. Howard Zucker said, \"While we have made tremendous progress in getting New Yorkers vaccinated, this pandemic is far from over and more must be done.\nThis mandate will both help close the vaccination gap and reduce the spread of the Delta variant.\nI want to thank all New York State's healthcare workers for stepping up once again and showing our state that getting vaccinated is safe, easy, and most importantly, effective.\""}, {"Summary": "Some people who are immunocompromised (have a weakened immune system) are more likely to get sick with COVID-19 or be sick for a longer period.\nPeople can be immunocompromised either because of a medical condition or because they receive immunosuppressive medications or treatments.\nIf you or someone you live or spend time with is immunocompromised, it is important to have a COVID-19 plan to protect yourself and others from infection.\nSince your immune response to COVID-19 vaccination may not be as strong as in people who are not immunocompromised, you may have different recommendations for COVID-19 vaccines.\nLearn more about COVID-19 vaccine recommendations for people who are moderately or severely immunocompromised."}]