[{"Summary": ""}, {"Summary": "Democrats, Republicans, and independents worked to pass the historic Civil Rights Act and the voting rights legislation.\nYou know, for the right to vote and to have that vote counted is democracy’s threshold liberty.\nBlack Americans were denied full citizenship and voting rights until 1965.\nHere in Georgia, for years, you’ve done the hard work of democracy: registering voters, educating voters, getting voters to the polls.\nThe same way, I might add, in the 2020 Election, President Trump voted from behind the desk in the White House — in Florida."}, {"Summary": "And we’ve passed that already, but they’re not going to see it immediately; it’s going to take a moment.\nThe bottom line for people on Medicare: They’re going to have less inflation; they’re not going to be paying as much money out.\nThat’s competition.\nBut that’s competition.\nI’m going to turn it over to Brian so you can start the meeting and keep us going."}, {"Summary": "That means Russian oil will no longer be acceptable at U.S. ports, and the American people will deal another powerful blow to Putin’s war machine.\nAmericans have rallied support — have rallied to support the Ukrainian people and made it clear we will not be part of subsidizing Putin’s war.\nPutin’s war — Putin’s war has caused enormous suffering and needless loss of life of women, children, everyone in Ukraine — both Ukraine and, I might add, Russians.\nRussia may continue to grind out its advance at a horrible price, but this much is already clear: Ukraine will never be a victory for Putin.\nAnd when the history of this war is written, Putin’s war on Ukraine will have left Russia weaker and the rest of the world stronger."}, {"Summary": "My Administration has made significant progress in making healthcare more affordable and accessible to millions of Americans.\nFrom the end of 2020 to September 2021, one in seven uninsured Americans gained coverage, leaving the uninsured rate at nearly an all-time low.\nThe effects of being uninsured or underinsured can be devastating financially, as families without access to affordable coverage may accrue high levels of medical debt.\nIt remains the policy of my Administration to protect and strengthen Medicaid and the ACA and to make high-quality healthcare accessible and affordable for every American.\nAgencies with authorities and responsibilities related to Medicaid and the ACA are continuing their review of existing agency actions under Executive Order 14009."}, {"Summary": "Fifty years ago, Roe v. Wade was decided and has been the law of the land since then.\nThis landmark case protected a woman’s right to choose, her right to make intensely personal decisions with her doctor, free from the inter- — from interference of politics.\nRoe v. Wade was a 7 to 2 decision written by a justice appointed by a Republican President, Richard Nixon.\nIn the five decades that followed Roe v. Wade, justices appointed by Republican Presidents — from Eisenhower, Nixon, Reagan, George W.\nUntil then, I will do all in my power to protect a woman’s right in states where they will face the consequences of today’s decision."}, {"Summary": "Glasgow must be the kickoff of a decade — a decade of ambition and innovation to preserve our shared future.\nIn the past few months, the United States has experienced all of this, and every region of the world can tell similar stories.\nBut, ladies and gentlemen, within the growing catastrophe, I believe there’s an incredible opportunity, not just for the United States but for all of us.\nOn my very first day in office, I took action to return the United States to the Paris Agreement.\nIn the lead-up to this gathering, the United States joined our G7 partners to launch a Build Back Better World initiative."}, {"Summary": "Recent polls have shown that an overwhelming majority of Americans believe our democracy at — is at risk, that our democracy is under threat.\nIt’s about what makes America “America.” It’s about the durability of our democracy.\nThe remarkable thing about American democracy is this: Just enough of us, on just enough occasions, have chosen not to dismantle democracy but to preserve democracy.\nThat’s democracy.\nIn our bones, we know democracy at risk — is at risk."}, {"Summary": "Jill and I were shocked and saddened to learn of the vicious attack on Salman Rushdie yesterday in New York.\nWe, together with all Americans and people around the world, are praying for his health and recovery.\nI am grateful to the first responders and the brave individuals who jumped into action to render aid to Rushdie and subdue the attacker.\nSalman Rushdie—with his insight into humanity, with his unmatched sense for story, with his refusal to be intimidated or silenced—stands for essential, universal ideals.\nAnd today, we reaffirm our commitment to those deeply American values in solidarity with Rushdie and all those who stand for freedom of expression."}, {"Summary": "The United States House of Representatives passed the Infrastructure Investment and Jobs Act, a once-in-generation bipartisan infrastructure bill that will create millions of jobs, turn the climate crisis into an opportunity, and put us on a path to win the economic competition for the 21st Century.\nIt will create good-paying jobs that can’t be outsourced.\nJobs that will transform our transportation system with the most significant investments in passenger and freight rail, roads, bridges, ports, airports, and public transit in generations.\nThe bill will create jobs replacing lead water pipes so every family can drink clean water.\nThe Build Back Better Act will be a once-in-a-generation investment in our people."}]