[{"Summary": "Israel says Hamas uses civilian structures, including hospitals, as bases for military operations in violation of international law; areas including medical centers, schools, mosques and residential locations have been struck under Israel’s bombardment.\nPalestinians and some international observers have accused Israel of breaking the law with a disproportionate military response.\nSenior U.S. officials have backed Israel, though the Israeli military has yet to show incontrovertible proof of a vast Hamas tunnel network.\nHamas and hospital officials had denied the accusations.\nAlmost two days after Israel began its raid of Al-Shifa, New York Times journalists were taken on a controlled tour of the complex by Israeli military officials, and saw a shaft on the hospital grounds."}, {"Summary": "Israeli officials have promised a full investigation into what went wrong.\nIsraeli officials misjudged the threat posed by Hamas for years, and more critically in the run-up to the attack.\nInstead, Israeli intelligence assessed that Hamas was trying to foment violence against Israelis in the West Bank, which is controlled by its rival, the Palestinian Authority.\nOverall, arrogance among Israeli political and security officials convinced them that the country’s military and technological superiority to Hamas would keep the terrorist group in check.\nIn an echo of that attack, Hamas succeeded because Israeli officials made many of the same mistakes that were made in 1973."}, {"Summary": "Israel revised its official estimated death toll of the Oct. 7 Hamas attacks, lowering the number to about 1,200 people, down from the more than 1,400 initially cited, a spokesman for the country’s Foreign Ministry said on Friday night.\nFor both Israelis and Palestinians, the casualty counts in the monthlong war between Israel and Hamas have become emotionally charged figures.\nHere what’s we know about the death toll in Israel from the Oct. 7 attack.\nHow many people were killed in Israel during the Oct. 7 attacks?\n(Additionally, at least 46 Israeli soldiers have been killed since the ground invasion of Gaza began at the end of the month.)"}, {"Summary": "Barak, the Israeli defense minister, is the most decorated soldier in the country’s history and one of its most experienced and controversial politicians.\nHe has served as chief of the general staff for the Israel Defense Forces, interior minister, foreign minister and prime minister.\nHe now faces, along with Prime Minister Benjamin Netanyahu and 12 other members of Israel’s inner security cabinet, the most important decision of his life — whether to launch a pre-emptive attack against Iran.\nDoes Israel have overt or tacit support, particularly from America, for carrying out an attack?\nHave all other possibilities for the containment of Iran’s nuclear threat been exhausted, bringing Israel to the point of last resort?"}, {"Summary": "director warned Tuesday that the Israel-Hamas war had raised the potential for an attack against Americans to a new level and escalated threats against Jews and Muslims in the United States.\n“The ongoing war in the Middle East has raised the threat of an attack against Americans in the United States to a whole other level,” he added.\nThe number of antisemitic acts in the United States had been on the rise even before the Israel-Hamas war, led in part by white supremacist propaganda and new nationalist groups across the country.\n“I will say that this is a threat that is reaching in some way sort of historic levels,” Mr. Wray said.\nThe war has been politically divisive in the United States as well."}, {"Summary": "An emergency medical worker pouring mineral water from a bottle to douse the smoldering remains of charred bodies.\nReporters were told by the Israeli military not to record the footage.\nCertain sections, including video of a raid on a military base, have been previously verified by The New York Times.\nFootage from closed-circuit cameras captured one man scooping up two young boys, both wearing only underpants, as early morning sirens wailed, warning of incoming rocket fire.\nMany traumatized Israelis are only beginning to internalize the enormity of the disaster of Oct. 7."}, {"Summary": "Follow live news updates on the Israel-Hamas war.\nLast weekend’s attack on Israel by Hamas has brought renewed scrutiny of the armed Palestinian group’s longstanding relationship with Iran, and questions about whether the Gaza-based group could have pulled off such a sophisticated and devastating operation on its own.\nIran has a long history of training and arming proxy militia groups in the region, from Gaza to Lebanon, Iraq and Syria.\nAnd over the past year, there have been signs that Iran and its proxies were preparing to take a more aggressive approach toward Israel.\nGen. Esmail Ghaani, who is in charge of supervising Iran’s network of proxy militias as head of the country’s paramilitary Quds Force, repeatedly traveled to Lebanon for covert sessions with leaders of Hamas and Hezbollah, a Shiite Lebanese militia that Iran also supports."}, {"Summary": "The thousands of young Israelis had spent the night dancing at an outdoor rave, many clad in tie-dye T-shirts and crop tops.\nThe militants gunned down more than 100 ravers and abducted others, according to two senior Israeli officials, as they sprinted through the open fields.\nThose who survived often did so by hiding in nearby bushes, some of them for hours.\nBullets whistled overhead and shots resounded all around, said Andrey Peairie, 35, one of the survivors.\nHe described crawling up to the top of a nearby hill to get a better sense of what was happening."}, {"Summary": "Israel Ziv, a former general, reached a nearby battle in his Audi.\n“We are brought up to run as fast as possible toward the fire,” said General Goldfus.\nThe camera mounted on the Hamas commander’s head captured the moment he was shot and killed.\nBy the time the video stops, the commander can be seen slumped on the ground, revealing his long beard and thinning hairline.\nIn other parts of southern Israel, the first formal reinforcements came from an Israeli commando unit that arrived in helicopters, according to the senior Israeli officer."}, {"Summary": "Gov’t blames Israel for June attack, accuses it of trying to derail negotiations in Vienna that could see harsh US sanctions lifted.\nGovernment spokesman Ali Rabiei said on Tuesday Israel was behind the June 23 attack on a building in Karaj that belongs to the Atomic Energy Organization of Iran.\nSuch an agreement could lift harsh US sanctions on Iran, something Israel has repeatedly warned against.\nThis is not the first time Iran has accused Israel of trying to thwart the Vienna talks that began earlier this year, also attended by China, Russia, Germany, France, the United Kingdom, and coordinated by the European Union.\nIran pointed the finger at Israel, and began enriching uranium to its highest rate ever in response."}]